app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "username", "email", "password_digest") VALUES (?, ?, ?, ?)  [["name", "Ethan"], ["username", "GoodGuyGuf"], ["email", "doop@hotmail.com"], ["password_digest", "$2a$12$pTnhJTk5pqmpRJN02wHIYer0gzSSdZAR8RFzTJKBvVkM1BOy/khee"]]